# Lessons Learned 

- What do where there multiple types of NaN values. Diffreniate Standard Missing values from Non-Standard
- Total NaN per column print(df.isnull().sum())
- data['NUM_BEDROOMS'].unique().tolist()

In [1]:
import pandas as pd
import numpy as np

In [3]:
pwd

'C:\\Users\\vipatha\\02_ScientificStack_0719\\Data_Cleaning\\Project 2'

In [4]:
data = pd.read_csv('C://Users//vipatha//02_ScientificStack_0719//data/property data.csv')

In [5]:
data.head(5)

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [6]:
data.isna().any()

PID              True
ST_NUM           True
ST_NAME         False
OWN_OCCUPIED     True
NUM_BEDROOMS     True
NUM_BATH         True
SQ_FT            True
dtype: bool

In [25]:
print (data.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
PID             8 non-null float64
ST_NUM          7 non-null float64
ST_NAME         9 non-null object
OWN_OCCUPIED    8 non-null object
NUM_BEDROOMS    7 non-null object
NUM_BATH        8 non-null object
SQ_FT           8 non-null object
dtypes: float64(2), object(5)
memory usage: 584.0+ bytes

In [10]:
data['NUM_BEDROOMS'].unique().tolist()

['3', nan, '1', '2', 'na']

In [11]:
data['NUM_BATH'].unique().tolist()

['1', '1.5', nan, '2', 'HURLEY']

In [14]:
data['SQ_FT'].unique().tolist()

['1000', '--', '850', '700', '1600', '800', '950', nan, '1800']

In [15]:
# Each of these columns have various types of missing values

# na, --,

In [17]:
# Making a list of STANDARD missing value types
missing_values = ["n/a", "na", "--"]
df = pd.read_csv("C://Users//vipatha//02_ScientificStack_0719//data/property data.csv", na_values = missing_values)

In [18]:
df.head(5)

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [19]:
df['OWN_OCCUPIED'].unique().tolist()

['Y', 'N', '12', nan]

In [29]:
df['OWN_OCCUPIED'] = df['OWN_OCCUPIED'].replace(to_replace = '12', 
                 value ='NaN')

In [30]:
df.head(5)

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN  LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0   BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0   BERKELEY            Y           3.0        2  1600.0

In [31]:
print(df.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64